InjMoldSimulation/constant/cpTable
// zeros stand for pressure, see kappaTable if needed
(
(273.15((0 1667.55543)))
(283.15((0 1708.84936)))
(293.15((0 1748.48428)))
(303.15((0 1786.75604)))
(313.15((0 1824.16454)))
(323.15((0 1861.99986)))
(333.15((0 1903.05119)))
(343.15((0 1951.48136)))
(353.15((0 2011.3643)))
(363.15((0 2086.40843)))
(365.15((0 4139.99256)))
(367.15((0 6123.47152)))
(369.15((0 7949.36039)))
(371.15((0 9535.51328)))
(373.15((0 10809.4524)))
(375.15((0 11714.2087)))
(377.15((0 12208.5734)))
(379.15((0 12269.2598)))
(381.15((0 11887.7004)))
(383.15((0 11080.942)))
(385.15((0 9887.15463)))
(387.15((0 8358.44609)))
(389.15((0 6561.87395)))
(391.15((0 4575.48412)))
(393.15((0 2489.8731)))
(418.15((0 2566.56475)))
(443.15((0 2643.86184)))
(468.15((0 2721.08077)))
(493.15((0 2797.85057)))
(518.15((0 2875.2014)))
(543.15((0 2952.06388)))
(568.15((0 3029.19013)))
(593.15((0 3106.54096)))
)
