InjMoldSimulation/constant/kappaTable
(
(363.15((20e6 0.303703667)(80e6 0.3227515)(120e6 0.373456833)))
(372.408((20e6 0.291212722)(80e6 0.3227515)(120e6 0.373456833)))
(378.58((20e6 0.282885425)(80e6 0.314206435)(120e6 0.373456833)))
(393.15((20e6 0.2632275)(80e6 0.294034431)(120e6 0.341678611)))
(402.408((20e6 0.2632275)(80e6 0.281216833)(120e6 0.321486244)))
(408.58((20e6 0.2632275)(80e6 0.281216833)(120e6 0.308024667)))
)
