InjMoldSimulation/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /   A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

// ************************************************************************* //

solvers
{
    alpha.liquid
    {
        nAlphaCorr      2;
        nAlphaSubCycles 1;
        cAlpha          0.5;
    }

    ".*(rho|rhoFinal)"
    {
        solver          diagonal;
    }

    "(elSigDev|elSigDevFinal)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
    }

    pcorr
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-6;
            relTol          0.01;
            smoother        DICGaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            nFinestSweeps   2;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }
        tolerance       1e-6;
        relTol          0.01;
        maxIter         100;
    }

    p_rgh
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0.01;
        smoother        DIC;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    p_rghFinal
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-5;
            relTol          0.01;
            nVcycles        2;
            smoother        DICGaussSeidel;
            nPreSweeps      2;
            nPostSweeps     2;
            nFinestSweeps   2;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }
        tolerance       1e-5;
        relTol          0.01;
        maxIter         20;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
        nSweeps         1;
    }

    "(T|k|B|nuTilda).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
    }
}

PIMPLE
{
    momentumPredictor no;
    transonic       no;
    nOuterCorrectors 4;
    nCorrectors     1;
    nNonOrthogonalCorrectors 2;

    outerCorrectorResidualControl
    {
        p_rgh
        {
                tolerance   1e-56;
                relTol      0.0;
        }
        T
        {
                tolerance   1e-5;
                relTol      0.0;
        }
        elSigDev
        {
                tolerance   1e-5;
                relTol      0.0;
        }
     }
}

relaxationFactors
{
    fields
    {
        p_rgh         0.4;
        T             1.0;
        elSigDev      0.6;
    }
    equations
    {
        "U|k|epsilon|T|elSigDev"     0.7;
    }
}

// ************************************************************************* //

